In [2]:
import pandas as pd
df1 = pd.read_csv("D:\\Deepak Personal\\PYTHON and DS\\ANIL JADON\\Data-master\\Pandas_Exercise_Practice_Data\\tips.csv")
df1.head()

   index  total_bill   tip     sex smoker  day    time  size
0      0       16.99  1.01  Female     No  Sun  Dinner     2
1      1       10.34  1.66    Male     No  Sun  Dinner     3
2      2       21.01  3.50    Male     No  Sun  Dinner     3
3      3       23.68  3.31    Male     No  Sun  Dinner     2
4      4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
df1.describe()

            index  total_bill         tip        size
count  244.000000  244.000000  244.000000  244.000000
mean   121.500000   19.785943    2.998279    2.569672
std     70.580923    8.902412    1.383638    0.951100
min      0.000000    3.070000    1.000000    1.000000
25%     60.750000   13.347500    2.000000    2.000000
50%    121.500000   17.795000    2.900000    2.000000
75%    182.250000   24.127500    3.562500    3.000000
max    243.000000   50.810000   10.000000    6.000000

In [9]:
df1["total_bill"].max() #max bill

50.81

In [11]:
maxpaid = df1["total_bill"].max() + df1["tip"].max()
maxpaid

60.81

In [12]:
df1.head(2)

   index  total_bill   tip     sex smoker  day    time  size
0      0       16.99  1.01  Female     No  Sun  Dinner     2
1      1       10.34  1.66    Male     No  Sun  Dinner     3

In [13]:
df1.tail()

     index  total_bill   tip     sex smoker   day    time  size
239    239       29.03  5.92    Male     No   Sat  Dinner     3
240    240       27.18  2.00  Female    Yes   Sat  Dinner     2
241    241       22.67  2.00    Male    Yes   Sat  Dinner     2
242    242       17.82  1.75    Male     No   Sat  Dinner     2
243    243       18.78  3.00  Female     No  Thur  Dinner     2

In [5]:
df1[df1['smoker']=='Yes']['sex'].value_counts() #like where condition - how many male & female are smokers

Male      60
Female    33
Name: sex, dtype: int64

In [26]:
df1['total_bill'].mean()  #df1.total_bill.mean()

19.785942622950824

In [81]:
weather_data = {
    'day': ['1/1/2019','1/2/2019','1/3/2019','1/4/2019','1/5/2019','1/6/2019'],
    'temp': [32,35,28,24,32,31],
    'windspeed': [6.1,7.2,2.6,7.5,4.4,2.8],
    'event': ['Rain','Sunny','Snow','Sunny','Rain','Sunny']
}
df = pd.DataFrame(weather_data) #using dictonery
df

        day  temp  windspeed  event
0  1/1/2019    32        6.1   Rain
1  1/2/2019    35        7.2  Sunny
2  1/3/2019    28        2.6   Snow
3  1/4/2019    24        7.5  Sunny
4  1/5/2019    32        4.4   Rain
5  1/6/2019    31        2.8  Sunny

In [32]:
rows, columns = df.shape #df.shape = rows,columns

In [34]:
columns

4

In [35]:
df.head(2)

        day  temp  windspeed  event
0  1/1/2019    32        6.1   Rain
1  1/2/2019    35        7.2  Sunny

In [36]:
df[2:5]

        day  temp  windspeed  event
2  1/3/2019    28        2.6   Snow
3  1/4/2019    24        7.5  Sunny
4  1/5/2019    32        4.4   Rain

In [40]:
df.columns

Index(['day', 'temp', 'windspeed', 'event'], dtype='object')

In [42]:
df.day

0    1/1/2019
1    1/2/2019
2    1/3/2019
3    1/4/2019
4    1/5/2019
5    1/6/2019
Name: day, dtype: object

In [43]:
df['event'] #df.event

0     Rain
1    Sunny
2     Snow
3    Sunny
4     Rain
5    Sunny
Name: event, dtype: object

In [44]:
type(df)

pandas.core.frame.DataFrame

In [45]:
type(df['event'])

pandas.core.series.Series

In [46]:
df[['event','day','temp']]

   event       day  temp
0   Rain  1/1/2019    32
1  Sunny  1/2/2019    35
2   Snow  1/3/2019    28
3  Sunny  1/4/2019    24
4   Rain  1/5/2019    32
5  Sunny  1/6/2019    31

In [47]:
df['temp'].mean()

30.333333333333332

In [49]:
df.describe()

            temp  windspeed
count   6.000000   6.000000
mean   30.333333   5.100000
std     3.829708   2.154066
min    24.000000   2.600000
25%    28.750000   3.200000
50%    31.500000   5.250000
75%    32.000000   6.925000
max    35.000000   7.500000

In [50]:
df[['event','day','temp']][df['temp']==df['temp'].max()]  #condition wise data

   event       day  temp
1  Sunny  1/2/2019    35

In [51]:
df[df['temp']>30]

        day  temp  windspeed  event
0  1/1/2019    32        6.1   Rain
1  1/2/2019    35        7.2  Sunny
4  1/5/2019    32        4.4   Rain
5  1/6/2019    31        2.8  Sunny

In [54]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [82]:
df.set_index('day', inplace=True)
df

          temp  windspeed  event
day
1/1/2019    32        6.1   Rain
1/2/2019    35        7.2  Sunny
1/3/2019    28        2.6   Snow
1/4/2019    24        7.5  Sunny
1/5/2019    32        4.4   Rain
1/6/2019    31        2.8  Sunny

In [59]:
df.loc['1/6/2019']

temp            31
windspeed      2.8
event        Sunny
Name: 1/6/2019, dtype: object

In [83]:
df.reset_index(inplace = True)
df

        day  temp  windspeed  event
0  1/1/2019    32        6.1   Rain
1  1/2/2019    35        7.2  Sunny
2  1/3/2019    28        2.6   Snow
3  1/4/2019    24        7.5  Sunny
4  1/5/2019    32        4.4   Rain
5  1/6/2019    31        2.8  Sunny

In [84]:
df

        day  temp  windspeed  event
0  1/1/2019    32        6.1   Rain
1  1/2/2019    35        7.2  Sunny
2  1/3/2019    28        2.6   Snow
3  1/4/2019    24        7.5  Sunny
4  1/5/2019    32        4.4   Rain
5  1/6/2019    31        2.8  Sunny

In [86]:
df2 = pd.read_excel("D:\\Deepak Personal\\PYTHON and DS\\ANIL JADON\\Data-master\\Pandas_Exercise_Practice_Data\\demo1.xlsx","Sheet1")
df2

         day  temp  windspeed  event
0 2019-01-01    32        6.1   Rain
1 2019-01-02    35        7.2  Sunny
2 2019-01-03    28        2.6   Snow
3 2019-01-04    24        7.5  Sunny
4 2019-01-05    32        4.4   Rain
5 2019-01-06    31        2.8  Sunny

In [91]:
weather_data2 = [
    ('1/1/2019',32,6.1,'Rain'),
    ('2/1/2019',35,7.2,'Sunny'),
    ('3/1/2019',28,2.6,'Snow'),
    ('4/1/2019',24,7.5,'Sunny'),
    ('5/1/2019',32,4.4,'Rain'),
    ('6/1/2019',31,2.8,'Sunny')
]

df3 = pd.DataFrame(weather_data2, columns=['day','temperature','windspeed','event'])
df3 #dataframe using tuple

        day  temperature  windspeed  event
0  1/1/2019           32        6.1   Rain
1  2/1/2019           35        7.2  Sunny
2  3/1/2019           28        2.6   Snow
3  4/1/2019           24        7.5  Sunny
4  5/1/2019           32        4.4   Rain
5  6/1/2019           31        2.8  Sunny

In [7]:
df4 = pd.read_csv("D:\\Deepak Personal\\PYTHON and DS\\ANIL JADON\\Data-master\\Pandas_Exercise_Practice_Data\\train.csv", header=0)
df4.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

# Groupby##

In [9]:
#Alcohol consumption
import pandas as pd
drinks = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [20]:
#Which continent drinks more beer on average?
drinks.groupby('continent').beer_servings.mean().sort_values( ascending = False)

continent
EU    193.777778
SA    175.083333
OC     89.687500
AF     61.471698
AS     37.045455
Name: beer_servings, dtype: float64

In [23]:
#For each continent print the statistics for wine consumption

drinks.groupby('continent').wine_servings.describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [24]:
#Print the mean alcoohol consumption per continent for every column

drinks.groupby('continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

In [25]:
#Print the median alcoohol consumption per continent for every column
drinks.groupby('continent').median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

In [26]:
#Print the mean, min and max values for spirit consumption
drinks.groupby('continent').spirit_servings.agg(['mean','min','max'])

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302

HH/Python/Python_Exercise3_PandasML_Solved/03_Grouping/Occupation/ 
#Occupation#

In [27]:
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep='|', index_col='user_id')

In [29]:
users.head(2)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043

In [73]:
users.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [82]:
(users[users['gender']=='M'].occupation.value_counts()/users.occupation.value_counts()*100).sort_values(ascending = False)

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
Name: occupation, dtype: float64

In [47]:
# Discover the Male ratio per occupation and sort it from the most to the least ##IMP - % Contribution##
def gender_to_number(x):
    if x == 'M':
        return 1
    if x == 'F':
        return 0

# apply the function to the gender column and create a new column

users['gender_n'] = users.gender.apply(gender_to_number)

a = users.groupby('occupation').gender_n.sum() #male split
b = users.occupation.value_counts()
a_b = a/b*100
a_b.sort_values(ascending = False)

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

In [48]:
#For each occupation, calculate the minimum and maximum ages
users.groupby('occupation').age.agg(['min','max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

In [50]:
#For each combination of occupation and gender, calculate the mean age
users.groupby(['occupation', 'gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

In [60]:
#For each occupation present the percentage of women and men
users.groupby(['occupation','gender']).gender.count()/users.groupby(['occupation']).gender.count()*100

occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
engineer       F           2.985075
               M          97.014925
entertainment  F          11.111111
               M          88.888889
executive      F           9.375000
               M          90.625000
healthcare     F          68.750000
               M          31.250000
homemaker      F          85.714286
               M          14.285714
lawyer         F          16.666667
               M          83.333333
librarian      F          56.862745
               M          43.137255
marketing      F          38.461538
               M          61.538462
none           F          44.444444
               M          55.555556
other          F          34.285714
               M          65.714286
programmer     F           9.090909
               M          90.909091
retired        F           7.142857
               M          92.857143
salesman       F          25.000000
               M          75.000000
scientist      F           9.677419
               M          90.322581
student        F          30.612245
               M          69.387755
technician     F           3.703704
               M          96.296296
writer         F          42.222222
               M          57.777778
Name: gender, dtype: float64

In [72]:
#users.groupby(['occupation', 'gender']).gender.count()
#users.groupby(['occupation']).gender.count()

# Regiment#
HH/Python/Python_Exercise3_PandasML_Solved/03_Grouping/Regiment/

In [83]:
import pandas as pd
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

regiment= pd.DataFrame(raw_data, columns = raw_data.keys())
regiment.head()

     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
4    Dragoons     1st     Cooze             3             70

In [88]:
#regiment.groupby('regiment').preTestScore.mean()
#What is the mean preTestScore from the regiment Nighthawks?

regiment[regiment.regiment == 'Nighthawks'].groupby('regiment').preTestScore.mean()

regiment
Nighthawks    15.25
Name: preTestScore, dtype: float64

In [100]:
#Present general statistics by company
regiment.groupby(['company']).describe().unstack()

                      company
postTestScore  count  1st         6.000000
                      2nd         6.000000
               mean   1st        57.666667
                      2nd        67.000000
               std    1st        27.485754
                      2nd        14.057027
               min    1st        25.000000
                      2nd        57.000000
               25%    1st        34.250000
                      2nd        58.250000
               50%    1st        66.000000
                      2nd        62.000000
               75%    1st        70.000000
                      2nd        68.000000
               max    1st        94.000000
                      2nd        94.000000
preTestScore   count  1st         6.000000
                      2nd         6.000000
               mean   1st         6.666667
                      2nd        15.500000
               std    1st         8.524475
                      2nd        14.652645
               min    1st         2.000000
                      2nd         2.000000
               25%    1st         3.000000
                      2nd         2.250000
               50%    1st         3.500000
                      2nd        13.500000
               75%    1st         4.000000
                      2nd        29.250000
               max    1st        24.000000
                      2nd        31.000000
dtype: float64

In [95]:
#What is the mean each company's preTestScore?

regiment.groupby('company').preTestScore.mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

In [96]:
#Present the mean preTestScores grouped by regiment and company
regiment.groupby(['regiment','company']).preTestScore.mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

In [105]:
#Present the mean preTestScores grouped by regiment and company without heirarchical
regiment.groupby(['regiment','company']).preTestScore.mean().unstack()
# unstack - re-shape just like pivot

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

In [117]:
#    Group the entire dataframe by regiment and company
regiment.groupby(['regiment','company']).mean().unstack(level=-1)

           preTestScore       postTestScore
company             1st   2nd           1st   2nd
regiment
Dragoons            3.5  27.5          47.5  75.5
Nighthawks         14.0  16.5          59.5  59.5
Scouts              2.5   2.5          66.0  66.0

In [123]:
#What is the number of observations in each regiment and company
regiment.groupby(['company','regiment']).size()

company  regiment
1st      Dragoons      2
         Nighthawks    2
         Scouts        2
2nd      Dragoons      2
         Nighthawks    2
         Scouts        2
dtype: int64

In [132]:
#Iterate over a group and print the name and the whole data from the regiment

## Group the dataframe by regiment, and for each regiment,

for name, group in regiment.groupby('regiment'):
    print (name)
    print (group)

Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70

In [133]:
g = regiment.groupby('regiment')
g.get_group('Nighthawks')

     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62